# vstGetPt3D

## Description
```pascal
PROCEDURE vstGetPt3D(
				inPtIndex : LONGINT;
				VAR outX  : REAL;
				VAR outY  : REAL;
				VAR outZ  : REAL;
				result    : BOOLEAN);
```

```python

def vs.vstGetPt3D(inPtIndex, result):
    return (outX, outY, outZ)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inPtIndex|LONGINT||
|outX|REAL||
|outY|REAL||
|outZ|REAL||
|result|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events